tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jesseduffield/lazygit"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Console Matrix
brew "cmatrix"
# Dependency Manager for PHP
brew "composer"
# Modern replacement for 'ls'
brew "exa"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Monitor data's progress through a pipe
brew "pv"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Opinionated Lua code formatter
brew "stylua"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Collaborative team software
cask "figma"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-powerline-symbols"
# Open-source video transcoder
cask "handbrake"
# WordPress local development tool by Flywheel
cask "local"
# Collaboration platform for API development
cask "postman"
